app/Controllers/Dashboard.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT *
FROM `images`
WHERE `id` = '1'
---
    public function index()
    {
        $usersModel = new UsersModel();
        $loggedUserID= session()->get('loggedUser');
        $userInfo= $usersModel->find($loggedUserID);
        $images= new ImageModel();
        $data = [
            'title' => 'Mi Galería',
            'userInfo' => $userInfo,
            'images' => $images->where('id',$userInfo['id'])->findAll()

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function create(){

        $usersModel = new UsersModel();
        $loggedUserID= session()->get('loggedUser');
        $userInfo= $usersModel->find($loggedUserID);